import React , {Component} from 'react';
import {AppRegistry , Text , View , Image ,StyleSheet ,ScrollView} from 'react-native';
import Articles from './components/Articles';
import styles from './css/styles';

export default class App extends Component{
	constructor(props){
		super(props);
		this.state={
			articles:[],
		}
	}

componentWillMount(){
		this.setState({
			articles:[
				{
				    title:'آموزش React Native' , 
					imageUrl:{uri:'https://roocket.ir/public/image/2017/11/15/cleancode.jpg'},
					body:'شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...'
			    },
			    {
				    title:'آموزش React Native' , 
					imageUrl:{uri:'https://roocket.ir/public/image/2017/11/23/electron.png'},
					body:'شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...'
			    },
			    {
				    title:'آموزش React Native' , 
					imageUrl:{uri:'https://roocket.ir/public/image/2017/11/15/cleancode.jpg'},
					body:'شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...'
			    },
			    {
				    title:'آموزش React Native' , 
					imageUrl:{uri:'https://roocket.ir/public/image/2017/11/15/cleancode.jpg'},
					body:'شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...شیوه نمایش درست به اندازه محتوایی که آن را نمایش می دهید روی کیفیت تاثیر می گذارد. به گمانم بتوانیم این سخن را در برنامه نویسی کامپیوتر نیز به کار ببر...'
			    },

			]
		});
}
render(){
		  
		return(
			<View>
			    <Articles articles={this.state.articles} />
			</View>
			);
	}
} 
 


AppRegistry.registerComponent('AndroidApp' , ()=> App);